const { readdirSync, statSync , fs} = require('fs');
require("dotenv").config();
const Discord = require('discord.js')
const client = new Discord.Client({
    intents: 3276543,
    partials: ['MESSAGE', 'CHANNEL', 'REACTION'],
    allowedMentions: { parse: ['everyone', 'roles', 'users'], repliedUser: true }
});
/////////////////////// بكجات ///////////////////////
const { Intents, Collection, Client, GuildMember, MessageActionRow, WebhookClient,MessagePayload, GatewayIntentBits, MessageSelectMenu, Modal, MessageEmbed,MessageButton, MessageAttachment, Permissions, TextInputComponent} = require('discord.js');
const chalk = require('chalk')
const { CommandCooldown , msToMinutes} = require('discord-command-cooldown');
const ms = require('ms');
const paypal = require('paypal-rest-sdk');
const { Database, MongoDriver, JSONDriver } = require("st.db");
const options = {
  driver: new JSONDriver('./database/database.json'),
};
const options2 = {
  driver: new JSONDriver('./database/Tickets.json'),
};

const options3 = {
  driver: new JSONDriver('./database/TicketCount.json'),
};
const options4 = {
  driver: new JSONDriver('./database/Points.json'),
};
const options5 = {
  driver: new JSONDriver('./database/ClosedTicket.json'),
};

const db = new Database(options);
const dbTickets = new Database(options2);
const TC = new Database(options3);
const dbpoint = new Database(options4);
const dbCloseTicket = new Database(options5);

/////////////////////// بكجات ///////////////////////
const settings = require('./config/settings.js')
const app = require('./function/Express.js')(settings.port , chalk);
const prefix = settings.prefix
module.exports = {app,  client, db , prefix , dbpoint , dbCloseTicket , dbTickets, TC , settings};

require('./SlashCommands/SlashCommand.js');
require('./function/function/ready.js')(client, chalk); 
const initializeCommands = require('./function/commands.js');initializeCommands();
app.set('views', './views'); 
app.set('view engine', 'ejs');
const logAndReturn = (value) => console.log(value);
process.on("unhandledRejection", logAndReturn);
process.on("uncaughtException", logAndReturn);
process.on('uncaughtExceptionMonitor', logAndReturn);
process.on('multipleResolves', logAndReturn);
const colorE = "15FFAF"


    ///////////////// Express //////////////
     const { join } = require('path');
const perms = '996364077817405531';
client.on('messageCreate', (message) => {
  if (message.content === '$spin') {
    if (message.member.roles.cache.some((role) => role.name === 'Spin') || message.member.roles.cache.some(r => r.id == perms)) {
      const button = new MessageButton()
        .setStyle('SUCCESS')
        .setLabel('Spin')
        .setCustomId('spin_button');
      const row = new MessageActionRow().addComponents(button);
      const embed = new MessageEmbed()
        .setColor('15FFAF')
        .setTitle(`**  Na7la \`S\` Wheel Of Luck・عجلة الحظ**`)
        .setDescription('> ** إضغط على الزر Spin لتدوير العجلة .**');
      message.channel.send({ embeds: [embed], components: [row] });
    } else {
      message.author.send({ content: `** لا يمكنك إستخدام هذا الزر .**`, ephemeral: true });
    }
  }
});

client.on('interactionCreate', async (interaction) => {
    if(!interaction.isButton()) return;
  if (interaction.customId == "spin_button") {
    if (interaction.member.roles.cache.some((role) => role.name === 'Member') || interaction.member.roles.cache.some(r => r.id == perms)) {
      const prizes = [
        { name: '<@&996382760564445184>', chance: 0.4 },
        { name: '<@&996382617198927873>', chance: 0.4 },
        { name: '50k', chance: 0.5 },
        { name: 'خصم 50', chance: 0.4 },
        { name: '70k', chance: 0.4 },
        { name: 'اعلان هير', chance: 0.3 },
        { name: 'اعلان ايفري', chance: 0.2 },
        { name: 'منشور هير', chance: 0.4 },
        { name: 'منشور ايفري', chance: 0.3 },
        
      ];
      const totalChance = prizes.reduce((acc, prize) => acc + prize.chance, 0);
      const random = Math.random() * totalChance;
      let selectedPrize = null;
      let cumulativeChance = 0;

      for (const prize of prizes) {
        cumulativeChance += prize.chance;
        if (random < cumulativeChance) {
          selectedPrize = prize;
          break;
        }
      }

      // Call the logWheelSpin function to log information
      logWheelSpin(interaction.user.id, interaction.member.user.id, selectedPrize.name, 'Spin');

      // Defer the reply before sending the interaction
      await interaction.deferReply();

      // Mention the user who clicked the button in the follow-up message
      if (selectedPrize) {
        await interaction.followUp(`** ${emj .Give} مبروك ! ${interaction.user} لقد ربحت : ${selectedPrize.name}**`);
      } else {
        await interaction.followUp(`**لف مرة أخري ${interaction.user} مجانا **`);
      }

      // Delete the original message
      await interaction.message.delete();
    } else {
      await interaction.reply({ content: `** لا يمكنك إستخام هذا الزر .**`, ephemeral: true });
    }
  }
});

// إعداد زر الـ VIP Spin
        
client.on('messageCreate', (message) => {
  if (message.content === '$vipspin') {
    if (message.member.roles.cache.some((role) => role.name === 'Spin') || message.member.roles.cache.some(r => r.id == perms)) {
      const button = new MessageButton()
        .setStyle('SUCCESS')
        .setLabel('VIP Spin')
        .setCustomId('spin_button1');
      const row = new MessageActionRow().addComponents(button);
      const embed = new MessageEmbed()
        .setColor('15FFAF')
        .setTitle(`**  Na7la \`S\` VIP Wheel Of Luck・عجلة الحظ**`)
        .setDescription('> ** إضغط على الزر VIP Spin لتدوير العجلة .**');
      message.channel.send({ embeds: [embed], components: [row] });
    } else {
      message.author.send({ content: `** لا يمكنك إستخدام هذا الزر .**`, ephemeral: true });
    } 
  }
});

// استجابة الزر الـ VIP Spin
client.on('interactionCreate', async (interaction) => {
  if(!interaction.isButton()) return;
  if (interaction.customId == "spin_button1") {
    if (interaction.member.roles.cache.some((role) => role.name === 'Member') || interaction.member.roles.cache.some(r => r.id == perms)) {
      const prizes = [
        { name: '<@&996365835465674792>', chance: 0.3 },
        { name: '<@&1173940676619157536>', chance: 0.3 },
      
        { name: '80k', chance: 0.3 },
        { name: '120k', chance: 0.2 },
        { name: '200k', chance: 0.2 },
        { name: '250k', chance: 0.1 },
        { name: '650k', chance: 0.0 },
        { name: 'مليون كريديت ', chance: 0.0 },
      ];
      const totalChance = prizes.reduce((acc, prize) => acc + prize.chance, 0);
      const random = Math.random() * totalChance;
      let selectedPrize = null;
      let cumulativeChance = 0;

      for (const prize of prizes) {
        cumulativeChance += prize.chance;
        if (random < cumulativeChance) {
          selectedPrize = prize;
          break;
        }
      }

      // دعوة وظيفة اللوج لتسجيل المعلومات
      logWheelSpin(interaction.user.id, interaction.member.user.id, selectedPrize.name, 'VIP Spin');

      await interaction.deferReply();

      if (selectedPrize) {
        await interaction.followUp(`** ${emj.Give} مبروك ! لقد ربحت : ${selectedPrize.name}**`);
      } else {
        await interaction.followUp('** لف مرة أخري مجانا**');
      }

      // Delete the original message
      await interaction.message.delete();
    } else {
      await interaction.reply({ content: `** لا يمكنك إستخدام هذا الزر .**`, ephemeral: true });
    }
  }
});
client.on('messageCreate', async msg => {
if(msg.content === "خط") {
if(!msg.member.roles.cache.has('996364077817405531'))return;
msg.delete()
msg.channel.send({content: `https://cdn.discordapp.com/attachments/1113504839696126044/1242779260486160384/20240521_223046.png?ex=6677f261&is=6676a0e1&hm=b53c2145a0ca80b21e9d4d31b08af662a9be21d2b447d55ba1341dd3a24507d8&`})
}
})
client.on("messageCreate" , message => {
      if(message.content.startsWith(prefix + "رتب") || message.content.startsWith(prefix + "معلومات")) {
let embed1 = new MessageEmbed() 
  .setTitle(`** Na7la \`S\` Information・المعلومات**`)
        .setDescription(`**إختر من الأزرار التالية ما يناسبك.**`)
        .setColor(`${colorE}`)
.setImage(`https://cdn.discordapp.com/attachments/1113504839696126044/1242812458981134376/20240521_222753.jpg?ex=66659c4c&is=66644acc&hm=ed70a4b50e0fce45fccabcb1681a59c53d78abe18224c1db3059a6ec56eaaa48&`)
        let row1 = new Discord.MessageActionRow().addComponents(
          new Discord.MessageButton()
          .setLabel("رتب")
          .setCustomId("roles")
          .setStyle("SUCCESS"),
          new Discord.MessageButton()
          .setLabel("إعلانات")
          .setCustomId("ads")
          .setStyle("SUCCESS"),
          new Discord.MessageButton()
          .setLabel("معلومات")
          .setCustomId("info")
          .setStyle("SUCCESS"),
          new Discord.MessageButton()
          .setLabel("منشورات مميزة")
          .setCustomId("manshorat")
          .setStyle("SUCCESS"),
          new Discord.MessageButton()
          .setLabel("رومات خاصة")
          .setCustomId("rooms")
          .setStyle("SUCCESS"), )
        message.channel.send({ embeds: [embed1], components:[row1] }) 
      }
});

client.on("interactionCreate" , async interaction => {
if(interaction.customId == "roles") {
  const message = await interaction.channel.messages.fetch(interaction.message.id); 
  let embed2 = new MessageEmbed() 
        .setDescription(`**رتب | Nà7la
<@&996368935211503616>

مميزاتها <:emoji_72:1242783131510116401>  :
<:74:1242783266348466197>  يمكن النشر في كل رومات البيع

<:74:1242783266348466197>  نشر الصور بكل رومات البيع

<:74:1242783266348466197>  امكانية المنشن هير في كل رومات البيع 

السـعـر : 100k <:emoji:1054764721267556382> 


<@&996382617198927873>  

مميزاتها <:emoji_72:1242783131510116401>  :

<:74:1242783266348466197>  امكانية النشر في كل رومات البيع ما عدى ( #৳・التصاميم   - #৳・البرمجيات )

<:74:1242783266348466197>  امكانية المنشن في كل رومات البيع

 <:74:1242783266348466197> امكانية نشر الصور

السـعـر : 85k <:emoji:1054764721267556382> 

 <@&996382760564445184>  

مميزاتها <:emoji_72:1242783131510116401>  :

 <:74:1242783266348466197> امكانية النشر في كل رومات البيع ماعدا ( #৳・البرمجيات  - #৳・التصاميم  )

<:74:1242783266348466197>  امكانية المنشن هير في كل رومات البيع ماعدا ( #৳・التصاميم   - #৳・البرمجيات   )

<:74:1242783266348466197> لا يمكن نشر صور

السـعـر : 70k <:emoji:1054764721267556382> 

<@&996382954521624666>

مميزاتها <:emoji_72:1242783131510116401> : 

<:74:1242783266348466197> امكانية النشر في كل الرومات ماعدا 
( #৳・البرمجيات  - 
#৳・التصاميم   ) 

<:74:1242783266348466197>  عدم امكانية نشر صور

<:74:1242783266348466197> عدم امكانية المنشن

السـعـر : 55k <:emoji:1054764721267556382>

<@&997259592176246835>

مميزاتها <:emoji_72:1242783131510116401> :

<:74:1242783266348466197>  امكانية النشر في روم ( #৳・التصاميم   )  

<:74:1242783266348466197> مع امكانية المنشن هير بروم ( #৳・التصاميم  )

<:74:1242783266348466197>  مع امكانية نشر صور بروم ( #৳・التصاميم  ) 

السـعـر : 40k <:emoji:1054764721267556382> 

<@&997260131962204262> 

مميزاتها <:emoji_72:1242783131510116401>  : 

<:74:1242783266348466197>  امكانية النشر بروم ( #৳・البرمجيات   )

<:74:1242783266348466197>  امكانية المنشن بروم ( #৳・البرمجيات   )

<:74:1242783266348466197>  امكانية نشر الصور بروم ( #৳・البرمجيات   )

السـعـر : 40k <:emoji:1054764721267556382> **`)

        .setColor(`${colorE}`)
  message.edit({ embeds: [embed2], components: [] })

  setTimeout(() => {
  interaction.channel.send(`** التحويل فقط لـ <@${bankid}> .**`); }, 500); 
}
});

//
client.on("interactionCreate" , async interaction => {
if(interaction.isButton()) {
if(interaction.customId == "ads") {
  let embed3 = new Discord.MessageEmbed() 
.setDescription(`معلومات الاعلانات :
**
<:74:1242783266348466197> # - NA7LA S : معلومات الاعلانات
**

# قسم حزمة الجولد :
**
<:74:1242783266348466197> منشن هير
<:emoji_79:1242799096725766154> السعر : 50k <:42:1242766803000754177> 


<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> منشن ايفري ون
<:emoji_79:1242799096725766154> السعر : 100k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمة السلفر :
**
<:74:1242783266348466197> قيفاوي في روم <#1210537674272931860> مع منشن ايفري ون
<:74:1242783266348466197> مدة القيف اوي 3 ايام
<:74:1242783266348466197> على 50k
<:emoji_79:1242799096725766154> السعر : 150k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمه بلاتينيوم :
**
<:74:1242783266348466197> روم خاص لسيرفرك وقيف اوي 
<:74:1242783266348466197> مدة القيف اوي 5 ايام
<:74:1242783266348466197> على 100k
<:emoji_79:1242799096725766154> السعر : 200k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمة بروكاست :
**

<:74:1242783266348466197> بروكاست للاونلاين ( يرسل لين يتبند )
<:emoji_79:1242799096725766154> السعر : 3m <:42:1242766803000754177> 


<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


<:74:1242783266348466197> بروكاست لكل الاونلاين ( ما يتبند )
<:emoji_79:1242799096725766154> السعر : 6m <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# قسم حزمة الدايموند 
**
<:74:1242783266348466197> قيف اوي اول كتروجي فيرالسيرفر شرط دخول سيرفرك
<:74:1242783266348466197> مدة القيف اوي 7 ايام
<:74:1242783266348466197> على 500k
<:emoji_79:1242799096725766154> السعر : 1m <:42:1242766803000754177> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
**

<:74:1242783266348466197> ملاحظات : لطلب إعلان يرجى التواصل مع الدعم الفني : <#996376383896957059> <:46:1242766808847482900> فقط.

التحويل فقط لـ <@979266698689519618> فقط .
أذا قمت بالتحويل لاحد غير الحساب المذكور أعلاه فلن يتم عمل الأعلان لك ولن نتحمل المسؤولية لخطأك .**`)
.setColor(`${colorE}`)
interaction.message.edit({ embeds: [embed3], components: [] })
  setTimeout(() => {
  interaction.channel.send(`** التحويل فقط لـ <@${bankid}> .**`); }, 500); 
}
}
});
//

//
client.on("interactionCreate" , async interaction => {
if(interaction.customId == "info") {
const message = await interaction.channel.messages.fetch(interaction.message.id); 
  let embed3 = new MessageEmbed() 
.setDescription(`** <:74:1242783266348466197> إضافات | # - Na7la S

<:74:1242783266348466197> رتبة تراست او موثوق : <@&1028594799961444472> 

# مميزاتها :
<:74:1242783266348466197> تكون مميز بين البائعين
<:74:1242783266348466197> تتميز بـ الثقة

# شروطها :
<:74:1242783266348466197> تنشر 15 عملية ناجحة في <#1236645925598793830> 
<:74:1242783266348466197> تجيب 5 آراء عنك في <#1235865566238081024> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> <@&1135173094269534228> 
<:74:1242783266348466197> <@&1135173285596893244> 
<:74:1242783266348466197> <@&1135173388948738170> 

# مميزاتها :
<:74:1242783266348466197> تعطيك 3 فرص لكي لا تنسحب رتبتك البيع , بمعنى إنك حصلت على 3 تحذيرات فـ سوف نُزيل منك رتبة واحده من اللايف ويبقى معك اثنين فقط , وكل 3 تحذيرات سوف نُزيل لايف واحد .

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# سـ3ـر الايفات :
<:74:1242783266348466197> ثلاث = 50k

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
# معلومات إضافية :

<:74:1242783266348466197> لإزالة التحذيرات :

<:74:1242783266348466197> <@&996693208111251477> 
<:74:1242783266348466197> <@&996693069183332352> 

<:74:1242783266348466197> لإزالة وارن واحد = 25k

<:74:1242783266348466197> لنقل رتب البيع من حساب إلى آخر = 30k

<:emoji_78:1242783447689461822> ملاحظات : ماتقدر تطلب لايف واحده ! , يأتي ثلاثه مع بعض ( اللايفات ) , لشراء لايفات او لأستلام رتبة تراست او إزالة تحذير او نقل رتبة والخ.. يرجى التواصل مع <#996376383896957059> فقط .

<:74:1242783266348466197> __التحويل فقط لـ <@979266698689519618> 
إذا قُمت بالتحويل لأحد غير الحساب المذكور أعلاه فلن يتم تسليمك اي شي ولن نتحمل المسؤولية لخطأك .__**`)
.setColor(`${colorE}`)
message.edit({ embeds: [embed3], components: [] })
  setTimeout(() => {
  interaction.channel.send(`** التحويل فقط لـ <@${bankid}> .**`); }, 500); 
}
});

//
client.on("interactionCreate" , async interaction => {
if(interaction.customId == "manshorat") {
const message = await interaction.channel.messages.fetch(interaction.message.id); 
  let embed3 = new MessageEmbed() 
.setDescription(`معلومات المنشورات :
**
<:74:1242783266348466197> # - NA7LA S : المنشورات المميزة

<:74:1242783266348466197> منشور هير ( للمتصلين )
<:emoji_79:1242799096725766154> السعر : 30k <:42:1242766803000754177> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> منشور ايفري ( للكل )
<:emoji_79:1242799096725766154> السعر : 60k <:42:1242766803000754177> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
**

# ملاحظة <:emoji_78:1242783447689461822> 
**
لم يتم عمل اي منشور مخالف لقوانين الديسكورد و السيرفر  و قوانين البيع

<:74:1242783266348466197> للأستفسار الرجاء التوجه الى <:29:1242766737200644136> <#996376383896957059> <:46:1242766808847482900> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
** <:74:1242783266348466197> التحويل فقط لـ

<@979266698689519618> ( 979266698689519618 ) 

<:emoji_78:1242783447689461822> لا نتحمل مسؤولية التحويل إلى شخص آخر .**`)
.setColor(`${colorE}`)
message.edit({ embeds: [embed3], components: []})
  setTimeout(() => {
  interaction.channel.send(`** التحويل فقط لـ <@${bankid}>**`); }, 500);
}
});

//
client.on("interactionCreate" , async interaction => {
if(interaction.customId == "rooms") {
  const message = await interaction.channel.messages.fetch(interaction.message.id); 
  let fi = interaction.guild.channels.cache.filter(ch => ch.name.startsWith("〢↯・"))
  var f;
  if(fi.size < 10) {
    f = "مفتوح" }
  if(fi.size >= 10) {
    f = "مغلق" }
  let embed3 = new MessageEmbed() 
.setDescription(`**
<:74:1242783266348466197>  # - NA7LA S : الرومات الخاصة
**

**
<:74:1242783266348466197>  روم خاص لمدة يوم واحد

<:emoji_79:1242799096725766154> السعر = 20k <:42:1242766803000754177> 

<:74:1242783266348466197>  روم خاص لمدة اسبوع

<:emoji_79:1242799096725766154>  السعر : 140k <:42:1242766803000754177> 

<:74:1242783266348466197>   تجديد الروم الخاص لمدة اسبوع

<:emoji_79:1242799096725766154>  السعر :  120k <:42:1242766803000754177> 
**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# قوانين الرومات الخاصة <:28:1242766492362342491> 
**
1 - يمنع عدم نشر في الروم الخاص بك لمدة يومين

2 - ممنوع ما تشفر الكلمات بالروم الخاص

3 - ممنوع تمنشن ايفري أكثر من مره او هير أكثر من المرات المسموحه لك

{ اذا لم تتبع القوانين سوف يتم سحب رومك الخاص ولا يمكنك تجديده الى في الاسبوع القادم }
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# ملاحظة <:emoji_78:1242783447689461822> 
**
في حال تم اعداد الروم الخاص لن يتم استرداد الأموال

للأستفسار و الشراء توجه الى <#996376383896957059> <:46:1242766808847482900> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

**<:74:1242783266348466197> التحويل فقط لـ

<@979266698689519618> ( 979266698689519618 ) 

<:emoji_78:1242783447689461822>  لا نتحمل مسؤولية التحويل إلى شخص آخر .**

> ${emj.Dot} الرومات المتوفرة : ${fi.size} 
> ${emj.Dot} \`${f}\` **`)
.setColor(`${colorE}`)
message.edit({ embeds: [embed3], components: []})
  setTimeout(() => {
  interaction.channel.send(`**للشراء قم بكتابة الأمر \`$شراء\` .**`); }, 500); 
}
});
client.on('messageCreate', async message => {
  if (message.content === '!sendm5drat') {
      if(!message.member.permissions.has(`ADMINISTRATOR`))return;
    const row = new MessageActionRow()
      .addComponents(
        new MessageSelectMenu()
          .setCustomId('select')
          .setPlaceholder('لروية المعلومات اضغط هنا')
          .addOptions([
            {
              label: 'الرتب العامة',
              description: 'اضغط لروية الرتب العامة',
              value: 'option1',
            },
            {
              label: 'الرتب المميزة',
              description: 'اضغط لروية الرتب المميزة',
              value: 'option2',
            },
            {
              label: 'الرومات الخاصة',
              description: 'اضغط لروية الرومات الخاصه',
              value: 'option3',
            },
 
{
              label: 'معلومات الاعلانات',
              description: 'اضغط لروية معلومات اعلانات',
              value: 'option4',
            },
{
              label: 'معلومات المنشورات',
              description: 'اضغط لروية معلومات المنشورات',
              value: 'option5',
            },
{
              label: 'الإضافات',
              description: 'اضغط لرورية جميع الإضافات',
              value: 'option6',
            },

          ]),
      );

    const embed = new MessageEmbed()
      .setTitle('# ~ NA7LA S')
      .setColor('#15FFAF')
      .setImage('https://cdn.discordapp.com/attachments/1113504839696126044/1242812458981134376/20240521_222753.jpg?ex=664f32cc&is=664de14c&hm=729f4d31aa0a5a3e26504841d4cae5174c2cb10ccfc813b9c2a41fcfbdbf4201&')
      .setDescription(`** 
 # ~ NA7LA S | المعلومات 

<:29:1242766737200644136> لمعرفة معلومات الرتب العاديه <:21:1242766459592249394> - اضغط على الرتب العامة <:32:1242766743018143795> 
<:29:1242766737200644136> لمعرفة معلومات الرتب المميزة <:21:1242766459592249394> - اضغط على الرتب المميزة <:32:1242766743018143795> 
<:29:1242766737200644136> لمعرفة معلومات الرومات الخاصة <:21:1242766459592249394> - اضغط على الرومات الخاصة <:22:1242766486687322163> 
<:29:1242766737200644136> لمعرفة معلومات الأعلانات <:21:1242766459592249394> - اضغط على معلومات الأعلانات <:31:1242766745744314418> 
<:29:1242766737200644136> لمعرفة معلومات المنشورات <:21:1242766459592249394> - اضغط على معلومات المنشورات <:27:1242766494639722527> 
<:29:1242766737200644136> لمعرفة معلومات العامة <:21:1242766459592249394> - اضغط على الأضافات <:64:1242766344924172330> 

<:emoji_79:1242799096725766154> أن كان لديك استفسار الرجاء التوجه الى <:29:1242766737200644136> <#996376383896957059>  <:46:1242766808847482900> لمساعدتك
**`);

    const message1 = await message.channel.send({ embeds: [embed], components: [row] });
}
});
client.on('interactionCreate', async interaction => {
if(!interaction.isSelectMenu())return;
if(interaction.values == "option1"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage(`https://media.discordapp.net/attachments/1113504839696126044/1249056554150269070/20240521_222425.jpg?ex=6665ea10&is=66649890&hm=df7091d9e82a77aac8452739317a80442caadb3088979a18eb0e1aa70d5d2811&`)
.setDescription(`**معلومات الرتب | # ~ NA7LA S
<@&996368935211503616>

مميزاتها <:emoji_72:1242783131510116401>  :
<:74:1242783266348466197>  يمكن النشر في كل رومات البيع

<:74:1242783266348466197>  نشر الصور بكل رومات البيع

<:74:1242783266348466197>  امكانية المنشن هير في كل رومات البيع 

السـعـر : 100k <:emoji:1054764721267556382> 


<@&996382617198927873>  

مميزاتها <:emoji_72:1242783131510116401>  :

<:74:1242783266348466197>  امكانية النشر في كل رومات البيع ما عدى ( <#1234335254228238427>   - <#1234335219163725884> )

<:74:1242783266348466197>  امكانية المنشن في كل رومات البيع

 <:74:1242783266348466197> امكانية نشر الصور

السـعـر : 85k <:emoji:1054764721267556382> 

 <@&996382760564445184>  

مميزاتها <:emoji_72:1242783131510116401>  :

 <:74:1242783266348466197> امكانية النشر في كل رومات البيع ماعدا ( <#1234335219163725884>  - <#1234335254228238427>  )

<:74:1242783266348466197>  امكانية المنشن هير في كل رومات البيع ماعدا ( <#1234335254228238427>   - <#1234335219163725884>   )

<:74:1242783266348466197> لا يمكن نشر صور

السـعـر : 70k <:emoji:1054764721267556382> 

<@&996382954521624666>

مميزاتها <:emoji_72:1242783131510116401> : 

<:74:1242783266348466197> امكانية النشر في كل الرومات ماعدا 
( <#1234335219163725884>  - 
<#1234335254228238427>   ) 

<:74:1242783266348466197>  عدم امكانية نشر صور

<:74:1242783266348466197> عدم امكانية المنشن

السـعـر : 55k <:emoji:1054764721267556382>

<@&997259592176246835>

مميزاتها <:emoji_72:1242783131510116401> :

<:74:1242783266348466197>  امكانية النشر في روم ( <#1234335254228238427>   )  

<:74:1242783266348466197> مع امكانية المنشن هير بروم ( <#1234335254228238427>  )

<:74:1242783266348466197>  مع امكانية نشر صور بروم ( <#1234335254228238427>  ) 

السـعـر : 40k <:emoji:1054764721267556382> 

<@&997260131962204262> 

مميزاتها <:emoji_72:1242783131510116401>  : 

<:74:1242783266348466197>  امكانية النشر بروم ( <#1234335219163725884>   )

<:74:1242783266348466197>  امكانية المنشن بروم ( <#1234335219163725884>   )

<:74:1242783266348466197>  امكانية نشر الصور بروم ( <#1234335219163725884>   )

السـعـر : 40k <:emoji:1054764721267556382> **
** <:74:1242783266348466197> التحويل فقط لـ

<@979266698689519618> ( 979266698689519618 ) 

<:emoji_78:1242783447689461822> لا نتحمل مسؤولية التحويل إلى شخص آخر .**`)


interaction.reply({embeds: [embed], ephemeral: true})
}else if(interaction.values == "option2"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage(`https://media.discordapp.net/attachments/1113504839696126044/1242813165419499571/20240521_222533-1.jpg?ex=66679734&is=666645b4&hm=855b6ad983767a9965ad02f21aacb8e95cc43777dc0b643c3eec1c111e5e5a3d&`)
.setDescription(`# ~ NA7LA S | الرتب المميزة

<:74:1242783266348466197> **# - NA7LA S : الرتب النادرة 

<:74:1242783266348466197> اسم الرتبة النادرة : N7
رتبة بلمنشن : <@&996365835465674792>
<:74:1242783266348466197> السعر : 250,000
**
# المميزات :
**

<:74:1242783266348466197> تقدر تكتب ف كل الرومات
<:74:1242783266348466197> لون اصفر
<:74:1242783266348466197> روم خاص ب الرتبه
<:74:1242783266348466197> تقدر تنشر كل يوم مره افري ون ف الروم الخاص بالرتبه**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305>
**
<:74:1242783266348466197> اسم الرتبه النادرة : N7 SUPERHERO
<:74:1242783266348466197> رتبة بلمنشن : <@&1173940676619157536>
<:74:1242783266348466197> السعر : 500,000
**
# المميزات :
**
<:74:1242783266348466197>تقدر اكتب ف كل الرومات
<:74:1242783266348466197> تقدر تكتب ف رومات البرمجة و التصميم
<:74:1242783266348466197> تقدر تنزل منشور مميز كل يوم منشورين هير و ايفري
<:74:1242783266348466197> لون بنفسجي مميز
 <:74:1242783266348466197>روم خاص بالرتبة ما ينتهي
<:74:1242783266348466197> تقدر تنشر كل ساعه مره افري ون ف الروم الخاص ب الرتبة
<:74:1242783266348466197> رتبة جديدة الحق عليهم قبل الجميع يمكن تصير محدودة و تصير تتاجز بيها
**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
** <:74:1242783266348466197> ملاحظات :  لشراء رتبة يرجى التواصل مع الدعم الفني
<#996376383896957059>  فقط .
التحويل فقط ل <@979266698689519618> فقط
أذا قمت بالتحويل لاحد غير الحساب المذكور أعلاه فلن يتم استلامك الرتبة النادرة ولن نتحمل المسؤولية لخطأك . **`)


interaction.reply({embeds: [embed], ephemeral: true})
}else if(interaction.values == "option3"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage()
.setDescription(`**
<:74:1242783266348466197>  # - NA7LA S : الرومات الخاصة
**

**
<:74:1242783266348466197>  روم خاص لمدة يوم واحد

<:emoji_79:1242799096725766154> السعر = 20k <:42:1242766803000754177> 

<:74:1242783266348466197>  روم خاص لمدة اسبوع

<:emoji_79:1242799096725766154>  السعر : 140k <:42:1242766803000754177> 

<:74:1242783266348466197>   تجديد الروم الخاص لمدة اسبوع

<:emoji_79:1242799096725766154>  السعر :  120k <:42:1242766803000754177> 
**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# قوانين الرومات الخاصة <:28:1242766492362342491> 
**
1 - يمنع عدم نشر في الروم الخاص بك لمدة يومين

2 - ممنوع ما تشفر الكلمات بالروم الخاص

3 - ممنوع تمنشن ايفري أكثر من مره او هير أكثر من المرات المسموحه لك

{ اذا لم تتبع القوانين سوف يتم سحب رومك الخاص ولا يمكنك تجديده الى في الاسبوع القادم }
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# ملاحظة <:emoji_78:1242783447689461822> 
**
في حال تم اعداد الروم الخاص لن يتم استرداد الأموال

للأستفسار و الشراء توجه الى <#996376383896957059> <:46:1242766808847482900> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

**<:74:1242783266348466197> التحويل فقط لـ

<@979266698689519618> ( 979266698689519618 ) 

<:emoji_78:1242783447689461822>  لا نتحمل مسؤولية التحويل إلى شخص آخر .**`)


interaction.reply({embeds: [embed], ephemeral: true})
}else if(interaction.values == "option4"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage(`https://media.discordapp.net/attachments/1113504839696126044/1249056481026904144/20240521_222601.jpg?ex=6665e9ff&is=6664987f&hm=04dcc042baf699da34a5b28ba050d8509db20f7bf76e8019814eae18f1a8e27a&`)
.setDescription(`معلومات الاعلانات :
**
<:74:1242783266348466197> # - NA7LA S : معلومات الاعلانات
**

# قسم حزمة الجولد :
**
<:74:1242783266348466197> منشن هير
<:emoji_79:1242799096725766154> السعر : 50k <:42:1242766803000754177> 


<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> منشن ايفري ون
<:emoji_79:1242799096725766154> السعر : 100k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمة السلفر :
**
<:74:1242783266348466197> قيفاوي في روم <#1210537674272931860> مع منشن ايفري ون
<:74:1242783266348466197> مدة القيف اوي 3 ايام
<:74:1242783266348466197> على 50k
<:emoji_79:1242799096725766154> السعر : 150k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمه بلاتينيوم :
**
<:74:1242783266348466197> روم خاص لسيرفرك وقيف اوي 
<:74:1242783266348466197> مدة القيف اوي 5 ايام
<:74:1242783266348466197> على 100k
<:emoji_79:1242799096725766154> السعر : 200k <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


# قسم حزمة بروكاست :
**

<:74:1242783266348466197> بروكاست للاونلاين ( يرسل مايتبند )
<:emoji_79:1242799096725766154> السعر : 1.5m <:42:1242766803000754177> 


<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 


<:74:1242783266348466197> بروكاست لكل الاونلاين ( ما يتبند )
<:emoji_79:1242799096725766154> السعر : 3m <:42:1242766803000754177> 

**
<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# قسم حزمة الدايموند 
**
<:74:1242783266348466197> قيف اوي اول كتروجي في السيرفر شرط دخول سيرفرك
<:74:1242783266348466197> مدة القيف اوي 7 ايام
<:74:1242783266348466197> على 500k
<:emoji_79:1242799096725766154> السعر : 1m <:42:1242766803000754177> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
**

<:74:1242783266348466197> ملاحظات : لطلب إعلان يرجى التواصل مع الدعم الفني : <#996376383896957059> <:46:1242766808847482900> فقط.

التحويل فقط لـ <@979266698689519618> فقط .
أذا قمت بالتحويل لاحد غير الحساب المذكور أعلاه فلن يتم عمل الأعلان لك ولن نتحمل المسؤولية لخطأك .**`)


interaction.reply({embeds: [embed], ephemeral: true})
}else if(interaction.values == "option5"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage(`https://media.discordapp.net/attachments/1113504839696126044/1249056610542682163/20240521_222553-1.jpg?ex=6665ea1e&is=6664989e&hm=f8323df09a8681c9858b8237034923bced633ace11765ec8ca1f3b65acfcef1c&`)
.setDescription(`معلومات المنشورات :
**
<:74:1242783266348466197> # - NA7LA S : المنشورات المميزة

<:74:1242783266348466197> منشور هير ( للمتصلين )
<:emoji_79:1242799096725766154> السعر : 30k <:42:1242766803000754177> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> منشور ايفري ( للكل )
<:emoji_79:1242799096725766154> السعر : 60k <:42:1242766803000754177> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
**

# ملاحظة <:emoji_78:1242783447689461822> 
**
لم يتم عمل اي منشور مخالف لقوانين الديسكورد و السيرفر  و قوانين البيع

<:74:1242783266348466197> للأستفسار الرجاء التوجه الى <:29:1242766737200644136> <#996376383896957059> <:46:1242766808847482900> 
**

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
** <:74:1242783266348466197> التحويل فقط لـ

<@979266698689519618> ( 979266698689519618 ) 

<:emoji_78:1242783447689461822> لا نتحمل مسؤولية التحويل إلى شخص آخر .**`)


interaction.reply({embeds: [embed], ephemeral: true})
}else if(interaction.values == "option6"){
let embed = new MessageEmbed()
.setColor("#15FFAF")
.setTitle("# ~ NA7LA S")
.setImage(`https://media.discordapp.net/attachments/1113504839696126044/1249056643363115199/20240521_222629.jpg?ex=6665ea26&is=666498a6&hm=fb816e1a4df9f82ac769dec88c9d44e29aeb931db98194f096109e586b143860&`)
.setDescription(`** <:74:1242783266348466197> إضافات | # - Na7la S

<:74:1242783266348466197> رتبة تراست او موثوق : <@&1028594799961444472> 

# مميزاتها :
<:74:1242783266348466197> تكون مميز بين البائعين
<:74:1242783266348466197> تتميز بـ الثقة

# شروطها :
<:74:1242783266348466197> تنشر 15 عملية ناجحة في <#1236645925598793830> 
<:74:1242783266348466197> تجيب 5 آراء عنك في <#1235865566238081024> 

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

<:74:1242783266348466197> <@&1135173094269534228> 
<:74:1242783266348466197> <@&1135173285596893244> 
<:74:1242783266348466197> <@&1135173388948738170> 

# مميزاتها :
<:74:1242783266348466197> تعطيك 3 فرص لكي لا تنسحب رتبتك البيع , بمعنى إنك حصلت على 3 تحذيرات فـ سوف نُزيل منك رتبة واحده من اللايف ويبقى معك اثنين فقط , وكل 3 تحذيرات سوف نُزيل لايف واحد .

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 

# سـ3ـر الايفات :
<:74:1242783266348466197> ثلاث = 50k

<:73:1242783209901789305><:73:1242783209901789305><:73:1242783209901789305> 
# معلومات إضافية :

<:74:1242783266348466197> لإزالة التحذيرات :

<:74:1242783266348466197> <@&996693208111251477> 
<:74:1242783266348466197> <@&996693069183332352> 

<:74:1242783266348466197> لإزالة وارن واحد = 25k

<:74:1242783266348466197> لنقل رتب البيع من حساب إلى آخر = 30k

<:emoji_78:1242783447689461822> ملاحظات : ماتقدر تطلب لايف واحده ! , يأتي ثلاثه مع بعض ( اللايفات ) , لشراء لايفات او لأستلام رتبة تراست او إزالة تحذير او نقل رتبة والخ.. يرجى التواصل مع <#996376383896957059> فقط .

<:74:1242783266348466197> __التحويل فقط لـ <@979266698689519618> 
إذا قُمت بالتحويل لأحد غير الحساب المذكور أعلاه فلن يتم تسليمك اي شي ولن نتحمل المسؤولية لخطأك .__**`)


interaction.reply({embeds: [embed], ephemeral: true})
}



})
client.login('token')